renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx24t/r_s12ad_rx24t.c
volatile uint16_t R_BSP_EVENACCESS_SFR * const  gp_dreg2_ptrs[ADC_REG_MAX+1] =
                    {

                        /* A/D data register */
                        &S12AD2.ADDR0,       /* channel 0 */
                        &S12AD2.ADDR1,       /* channel 1 */
                        &S12AD2.ADDR2,       /* channel 2 */
                        &S12AD2.ADDR3,       /* channel 3 */
                        &S12AD2.ADDR4,       /* channel 4 */
                        &S12AD2.ADDR5,       /* channel 5 */
                        &S12AD2.ADDR6,       /* channel 6 */
                        &S12AD2.ADDR7,       /* channel 7 */
                        &S12AD2.ADDR8,       /* channel 8 */
                        &S12AD2.ADDR9,       /* channel 9 */
                        &S12AD2.ADDR10,      /* channel 10 */
                        &S12AD2.ADDR11,      /* channel 11 */
                        &S12AD2.ADOCDR,      /* voltage sensor */
                        &S12AD2.ADDBLDR,     /* double trigger register */
                        &S12AD2.ADDBLDRA,    /* double trigger registerA */
                        &S12AD2.ADDBLDRB,    /* double trigger registerB */
                        &S12AD2.ADRD    /* self-diagnosis register */
                    };

/* In ROM. Sample State (SST) Register pointers */

/* 8-bit register pointers */
volatile uint8_t R_BSP_EVENACCESS_SFR * const  gp_sreg0_ptrs[ADC_SST_REG_MAX+1] =
                    {

                        /* A/D Sampling State Register */
                        &S12AD.ADSSTR0,     /* channel 0 */
                        &S12AD.ADSSTR1,     /* channel 1 */
                        &S12AD.ADSSTR2,     /* channel 2 */
                        &S12AD.ADSSTR3,     /* channel 3 */
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        NULL,
                        &S12AD.ADSSTRL,     /* channel 16 */
                        NULL
                    };

volatile uint8_t R_BSP_EVENACCESS_SFR * const  gp_sreg1_ptrs[ADC_SST_REG_MAX+1] =
                    {

                        /* A/D Sampling State Register */
                            &S12AD1.ADSSTR0,     /* channel 0 */
                            &S12AD1.ADSSTR1,     /* channel 1 */
                            &S12AD1.ADSSTR2,     /* channel 2 */
                            &S12AD1.ADSSTR3,     /* channel 3 */
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            &S12AD1.ADSSTRL,     /* channel 16 */
                            NULL
                    };

volatile uint8_t R_BSP_EVENACCESS_SFR * const  gp_sreg2_ptrs[ADC_SST_REG_MAX+1] =
                    {

                        /* A/D Sampling State Register */
                            &S12AD2.ADSSTR0,     /* channel 0 */
                            &S12AD2.ADSSTR1,     /* channel 1 */
                            &S12AD2.ADSSTR2,     /* channel 2 */
                            &S12AD2.ADSSTR3,     /* channel 3 */
                            &S12AD2.ADSSTR4,     /* channel 4 */
                            &S12AD2.ADSSTR5,     /* channel 5 */
                            &S12AD2.ADSSTR6,     /* channel 6 */
                            &S12AD2.ADSSTR7,     /* channel 7 */
                            &S12AD2.ADSSTR8,     /* channel 8 */
                            &S12AD2.ADSSTR9,     /* channel 9 */
                            &S12AD2.ADSSTR10,    /* channel 10 */
                            &S12AD2.ADSSTR11,    /* channel 11 */
                            NULL,
                            &S12AD2.ADSSTRO      /* voltage sensor */
                    };

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
static adc_err_t adc_check_open_cfg(uint8_t            unit,
                                    adc_mode_t  const  mode,
                                    adc_cfg_t * const  p_cfg,
                                    void     (* const  p_callback)(void *p_args));

static adc_err_t adc_check_scan_config(uint8_t const unit,  adc_ch_cfg_t *p_config);
#endif

static adc_err_t adc_configure_scan(uint8_t const unit,  adc_ch_cfg_t *p_config);
static void adc_configure_sensors(adc_ch_cfg_t  *p_config);
static void adc_enable_s12adi(uint8_t unit);
static void adc_enable_s12gbadi(uint8_t unit);
static void adc_enable_s12gcadi(uint8_t unit);

R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12adi0_isr, VECT(S12AD,S12ADI))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12adi1_isr, VECT(S12AD1,S12ADI1))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12adi2_isr, VECT(S12AD2,S12ADI2))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gbadi0_isr, VECT(S12AD,GBADI))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gbadi1_isr, VECT(S12AD1,GBADI1))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gbadi2_isr, VECT(S12AD2,GBADI2))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gcadi0_isr, VECT(S12AD,GCADI))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gcadi1_isr, VECT(S12AD1,GCADI1))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gcadi2_isr, VECT(S12AD2,GCADI2))

/******************************************************************************
* Function Name: adc_open
* Description  : This function applies power to the A/D peripheral, sets the
*                operational mode, trigger sources, interrupt priority, and
*                configurations common to all channels and sensors. If interrupt
*                priority is non-zero, the function takes a callback function
*                pointer for notifying the user at interrupt level whenever a
*                scan has completed.
*
* Arguments    : unit -
*                    0
*                mode -
*                    Operational mode (see enumeration below)
*                p_cfg-
*                    Pointer to configuration structure (see below)
*                p_callback-
*                    Optional pointer to function called from interrupt when
*                    a scan completes
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_AD_LOCKED-
*                    Open() call is in progress elsewhere
*                ADC_ERR_AD_NOT_CLOSED-
*                    Peripheral is still running in another mode; Perform
*                    R_ADC_Close() first
*                ADC_ERR_INVALID_ARG-
*                    mode or element of p_cfg structure has invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon mode
*                ADC_ERR_MISSING_PTR-
*                    p_cfg pointer is FIT_NO_PTR/NULL
*******************************************************************************/
adc_err_t adc_open(uint8_t     const  unit,
                    adc_mode_t  const  mode,
                    adc_cfg_t * const  p_cfg,
                    void     (* const  p_callback)(void *p_args))
{
    aregs_t     *p_regs;
    aregs2_t     *p_regs2;
    volatile uint16_t   u16_dummy;  /* Dummy read for "1" change to "0".(read first) */
    volatile uint8_t    u8_dummy;   /* Dummy read for "1" change to "0".(read first) */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    volatile uint32_t   ipl_value;
#endif

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    adc_err_t   err;

    /* Pointer check */
    if ((NULL == p_cfg) || (FIT_NO_PTR == p_cfg))
    {
        return ADC_ERR_MISSING_PTR;
    }

    err = adc_check_open_cfg(unit, mode, p_cfg, p_callback);
    if (ADC_SUCCESS != err)
    {
        return err;
    }
#endif

    /* ENSURE OPEN() NOT ALREADY IN PROGRESS */
    if (true == g_dcb[unit].opened)
    {
        return ADC_ERR_AD_NOT_CLOSED;
    }
    if (R_BSP_HardwareLock(ADC_PRV_LOCK(unit)) == false)
    {
        return ADC_ERR_AD_LOCKED;
    }

