renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx24t/r_s12ad_rx24t.c
        /* A/D Channel Select Register B0 initialize */
        p_regs->ADANSB0.WORD = 0;

        /* A/D Channel Select Register B1 initialize */
        p_regs->ADANSB1.WORD = 0;

        /* A/D Disconnection Detection Control Register initialize */
        p_regs->ADDISCR.BYTE = 0;

        /* A/D Group Scan Priority Control Register initialize */
        p_regs->ADGSPCR.WORD = 0;

        /* A/D Channel Select Register C0 initialize */
        p_regs->ADANSC0.WORD = 0;

        /* A/D Channel Select Register C1 initialize */
        p_regs->ADANSC1.WORD = 0;

        /* A/D Group C Trigger Select Register initialize */
        p_regs->ADGCTRGR.BYTE = 0;

        /* A/D Sampling State Register initialize */
        p_regs->ADSSTR0 = ADC_SST_CNT_DEFAULT;
        p_regs->ADSSTR1 = ADC_SST_CNT_DEFAULT;
        p_regs->ADSSTR2 = ADC_SST_CNT_DEFAULT;
        p_regs->ADSSTR3 = ADC_SST_CNT_DEFAULT;
        p_regs->ADSSTRL = ADC_SST_CNT_DEFAULT;

        /* Only unit1 has Sample-and-Hold circuit */
        if (1 == unit)
        {
            /* A/D Sample-and-Hold Circuit Control Register initialize */
            p_regs->ADSHCR.WORD = ADC_SST_SH_CNT_DEFAULT;
        }

        /* A/D Programmable Gain Amplifier Control Register initialize */
        p_regs->ADPGACR.WORD = 0x9999;

        /* A/D Programmable Gain Amplifier Gain Setting Register 0 initialize */
        p_regs->ADPGAGS0.WORD = 0x0000;

        /* SET MODE RELATED REGISTER FIELDS */
        g_dcb[unit].mode = mode;
        if ((ADC_MODE_SS_MULTI_CH_GROUPED == mode)
         || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A == mode))
        {
            p_regs->ADCSR.BIT.ADCS = ADC_ADCS_GROUP_SCAN;
        }
        else if ((ADC_MODE_SS_MULTI_CH_GROUPED_GROUPC == mode)
         || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode))
        {
            p_regs->ADCSR.BIT.ADCS = ADC_ADCS_GROUP_SCAN;
            p_regs->ADGCTRGR.BIT.GRCE = 1;       // Use Group C
        }
        else
        {
            if ((ADC_MODE_CONT_ONE_CH == mode) || (ADC_MODE_CONT_MULTI_CH == mode))
            {
                p_regs->ADCSR.BIT.ADCS = ADC_ADCS_CONT_SCAN;
            }

            /* other modes have ADCS=0 */
        }

        if ((ADC_MODE_SS_ONE_CH_DBLTRIG == mode)
         || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A == mode)
         || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode))
        {
            p_regs->ADCSR.BIT.DBLE = 1;         /* enable double trigger */
        }

        /* SET TRIGGER AND INTERRUPT PRIORITY REGISTER FIELDS */
        if (ADC_TRIG_SOFTWARE != p_cfg->trigger)
        {
            p_regs->ADSTRGR.BIT.TRSA = p_cfg->trigger;
        }

        if (ADC_TRIG_ASYNC_ADTRG == p_cfg->trigger)
        {
            p_regs->ADCSR.BIT.EXTRG = 1;        /* set ext trigger for async trigger */
        }

        if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
        {
            /* for Group B */
            p_regs->ADSTRGR.BIT.TRSB = p_cfg->trigger_groupb;

            /* for Group C */
            p_regs->ADGCTRGR.BIT.TRSC = p_cfg->trigger_groupc;

            if (0 == unit)
            {
                /* for Group B */
                IPR(S12AD,GBADI) = p_cfg->priority_groupb;

                /* for Group C */
                IPR(S12AD,GCADI) = p_cfg->priority_groupc;
            }
            else
            {
                /* for Group B */
                IPR(S12AD1,GBADI1) = p_cfg->priority_groupb;

                /* for Group C */
                IPR(S12AD1,GCADI1) = p_cfg->priority_groupc;
            }
        }

        /* for Group A */
        if (0 == unit)
        {
            IPR(S12AD,S12ADI) = p_cfg->priority;
        }
        else
        {
            IPR(S12AD1,S12ADI1) = p_cfg->priority;
        }

        /* SET REGISTER FIELDS FOR REMAINING PARAMETERS */
        p_regs->ADCER.BIT.ADRFMT = (ADC_ALIGN_LEFT == p_cfg->alignment) ? 1 : 0;
        p_regs->ADCER.BIT.ACE = (ADC_CLEAR_AFTER_READ_ON == p_cfg->clearing) ? 1 : 0;

        p_regs->ADADC.BYTE = p_cfg->add_cnt;
    }


    /* SAVE CALLBACK FUNCTION POINTER */
    g_dcb[unit].p_callback = p_callback;

    /* MARK DRIVER AS OPENED */
    g_dcb[unit].opened = true;
    R_BSP_HardwareUnlock(ADC_PRV_LOCK(unit));

    return ADC_SUCCESS;
} /* End of function adc_open() */


/******************************************************************************
* Function Name: adc_check_open_cfg
* Description  : If Parameter Checking is enabled, this function will simply
*                validate the parameters passed to the adc_open function.
** Arguments    : unit -
*                    0
*                mode -
*                    Operational mode (see enumeration below)
*                p_cfg-
*                    Pointer to configuration structure (see below)
*                p_callback-
*                    Optional pointer to function called from interrupt when
*                    a scan completes
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_INVALID_ARG-
*                    mode or element of p_cfg structure has invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon mode
*******************************************************************************/
#if (ADC_CFG_PARAM_CHECKING_ENABLE == 1)
static adc_err_t adc_check_open_cfg(uint8_t                unit,
                                    adc_mode_t const       mode,
                                    adc_cfg_t * const      p_cfg,
                                    void         (* const  p_callback)(void *p_args))
{

    /* Check for valid argument values */
    if ((unit > 2) || (p_cfg->priority > BSP_MCU_IPL_MAX))
    {
        return ADC_ERR_INVALID_ARG;
    }

    /* If interrupt driven, must have callback function */
    if ((0 != p_cfg->priority) && ((NULL == p_callback) || (FIT_NO_FUNC == p_callback)))
    {
        return ADC_ERR_ILLEGAL_ARG;
    }

    /* In double trigger mode, SW and async triggers not allowed */
    if ((ADC_MODE_SS_ONE_CH_DBLTRIG == mode)
    || ((ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A == mode) || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode)))
    {
        if ((ADC_TRIG_SOFTWARE == p_cfg->trigger) || (ADC_TRIG_ASYNC_ADTRG == p_cfg->trigger))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }

    /* Group checking; only synchronous triggers allowed; must be unique */
    if ((ADC_MODE_SS_MULTI_CH_GROUPED == mode) || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A == mode)
    || (ADC_MODE_SS_MULTI_CH_GROUPED_GROUPC == mode) || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode))
    {
        if ((ADC_TRIG_ASYNC_ADTRG == p_cfg->trigger_groupb)
        || (p_cfg->trigger == p_cfg->trigger_groupb)
        || (ADC_TRIG_SOFTWARE == p_cfg->trigger)
        || (ADC_TRIG_SOFTWARE == p_cfg->trigger_groupb))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        /* for Group C */
        if ((ADC_MODE_SS_MULTI_CH_GROUPED_GROUPC == mode) || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode))
        {
            if ((ADC_TRIG_ASYNC_ADTRG == p_cfg->trigger_groupc)
            || (p_cfg->trigger == p_cfg->trigger_groupc)
            || (p_cfg->trigger_groupb == p_cfg->trigger_groupc)
            || (ADC_TRIG_SOFTWARE == p_cfg->trigger_groupc))
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
        }

