renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx24t/r_s12ad_rx24t.c
        if (p_cfg->priority_groupb > BSP_MCU_IPL_MAX)
        {
            return ADC_ERR_INVALID_ARG;
        }

        if ((0 != p_cfg->priority_groupb)   /* Interrupt driven, must have callback function */
        && ((NULL == p_callback) || (FIT_NO_FUNC == p_callback)))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        /* for Group C */
        if ((ADC_MODE_SS_MULTI_CH_GROUPED_GROUPC == mode) || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode))
        {
            if (p_cfg->priority_groupc > BSP_MCU_IPL_MAX)
            {
                return ADC_ERR_INVALID_ARG;
            }

            if ((0 != p_cfg->priority_groupc)   /* Interrupt driven, must have callback function */
            && ((NULL == p_callback) || (FIT_NO_FUNC == p_callback)))
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
        }
    }

    return ADC_SUCCESS;
} /* End of function adc_check_open_cfg() */
#endif /* ADC_CFG_PARAM_CHECKING_ENABLE == 1 */


/******************************************************************************
* Function Name: adc_control
* Description  : This function provides commands for enabling channels and
*                sensors and for runtime operations. These include enabling/
*                disabling trigger sources and interrupts, initiating a
*                software trigger, and checking for scan completion.
*
* NOTE: Enabling a channel or a sensor, or setting the sample state count reg
*       cannot be done while the ADCSR.ADST bit is set (conversion in progress).
*       Because these commands should only be called once during initialization
*       before triggers are enabled, this should not be an issue. Registers
*       with this restriction include ADANSA0, ADANSA1, ADANSB0, ADANSB1, ADADS,
*       ADADC, ADADS0, ADADS1, ADSSTRx, ADSHCR, ADSHMSR, ADEXICR, ADCMPCR,
*       ADCMPANSR0, ADCMPANSR1, ADACMPANSER, ADCMPLR0, ADCMPLR1, ADCMPLER,
*       ADCMPDR0, ADCMPDR1, and some bits in ADCSR, ADCMPCR, ADGSPCR and TSCR.
*       No runtime operational sequence checking of any kind is performed.
*
* Arguments    : cmd-
*                    Command to run
*                p_args-
*                    Pointer to optional configuration structure
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_MISSING_PTR-
*                    p_args pointer is FIT_NO_PTR/NULL when required as an argument
*                ADC_ERR_INVALID_ARG-
*                    cmd or element of p_args structure has invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    argument is illegal based upon rest of configuration
*                ADC_ERR_SCAN_NOT_DONE-
*                    The requested scan has not completed
*                ADC_ERR_TRIG_ENABLED -
*                    Cannot configure comparator because a scan is running
*                ADC_ERR_CONDITION_NOT_MET -
*                    No chans/sensors passed comparator condition
*                ADC_ERR_UNKNOWN
*                    Did not receive expected hardware response
*******************************************************************************/
adc_err_t adc_control(uint8_t const       unit,
                        adc_cmd_t const     cmd,
                        void * const        p_args)
{
    adc_err_t       err = ADC_SUCCESS;
    adc_sst_t       *p_sample;
    adc_dda_t       *p_charge;
    aregs_t         *p_regs;
    aregs2_t        *p_regs2;

    /* A/D register address */
    if (0 == unit)
    {
        p_regs = (aregs_t *)&S12AD;
    }
    else if (1 == unit)
    {
        p_regs = (aregs_t *)&S12AD1;
    }
    else
    {
        p_regs2 = (aregs2_t *)&S12AD2;
    }

    /* DO UNIVERSAL PARAMETER CHECKING */
#if (ADC_CFG_PARAM_CHECKING_ENABLE == 1)
    if (unit > 2)
    {
        return ADC_ERR_INVALID_ARG;
    }

    /* Pointer check */
    if ((NULL == p_args) || (FIT_NO_PTR == p_args))
    {
        if ((ADC_CMD_SET_DDA_STATE_CNT == cmd)
        || (ADC_CMD_SET_SAMPLE_STATE_CNT == cmd)
        || (ADC_CMD_ENABLE_CHANS == cmd))
        {
            return ADC_ERR_MISSING_PTR;
        }
    }
#endif

    /* PROCESS INDIVIDUAL COMMANDS */
    switch (cmd)
    {
        case ADC_CMD_SET_DDA_STATE_CNT:

            /* Disconnection Detection Assist (DDA) */
            p_charge = (adc_dda_t *)p_args;
            if (2 == unit)
            {
#if (ADC_CFG_PARAM_CHECKING_ENABLE == 1)
                if (ADC_DDA_OFF != p_charge->method)
                {
                    if ((p_charge->num_states < ADC_DDA_STATE_CNT_MIN)
                    || (p_charge->num_states > ADC_DDA_STATE_CNT_MAX)
                    || (0 != p_regs2->ADCER.BIT.DIAGM)           // self-diagnosis enabled
                    || ((p_regs2->ADEXICR.WORD & 0x0200) != 0))  // sensors enabled
                    {
                        return ADC_ERR_ILLEGAL_ARG;
                    }
                }
#endif
                if (ADC_DDA_OFF == p_charge->method)
                {
                    p_regs2->ADDISCR.BYTE = 0;
                }
                else
                {

                    /* NOTE: Using Disconnect Detection Assist adds num_states x (#chans) ADCLKS to scan time */
                    p_regs2->ADDISCR.BYTE = (uint8_t)((ADC_DDA_PRECHARGE == p_charge->method) ? 0x10 : 0);
                    p_regs2->ADDISCR.BYTE |= p_charge->num_states;
                }
            }
            else
            {
#if (ADC_CFG_PARAM_CHECKING_ENABLE == 1)
                if (ADC_DDA_OFF != p_charge->method)
                {
                    if ((p_charge->num_states < ADC_DDA_STATE_CNT_MIN)
                    || (p_charge->num_states > ADC_DDA_STATE_CNT_MAX)
                    || (0 != p_regs->ADCER.BIT.DIAGM))          // self-diagnosis enabled
                    {
                        return ADC_ERR_ILLEGAL_ARG;
                    }
                }
#endif
                if (ADC_DDA_OFF == p_charge->method)
                {
                    p_regs->ADDISCR.BYTE = 0;
                }
                else
                {

                    /* NOTE: Using Disconnect Detection Assist adds num_states x (#chans) ADCLKS to scan time */
                    p_regs->ADDISCR.BYTE = (uint8_t)((ADC_DDA_PRECHARGE == p_charge->method) ? 0x10 : 0);
                    p_regs->ADDISCR.BYTE |= p_charge->num_states;
                }
            }
            break;

        case ADC_CMD_SET_SAMPLE_STATE_CNT:

            /* sampling state */
            p_sample = (adc_sst_t *)p_args;
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
            if ((p_sample->reg_id > ADC_SST_REG_MAX)
            || (p_sample->num_states < ADC_SST_CNT_MIN))
            {
                return ADC_ERR_INVALID_ARG;
            }
#endif
            *(ADC_PRV_GET_SST_ARR(unit))[p_sample->reg_id] = p_sample->num_states;
            break;

        case ADC_CMD_ENABLE_CHANS:

            /* Specifies the A/D conversion channel. */
            err = adc_configure_scan(unit, (adc_ch_cfg_t *)p_args);
            break;

        case ADC_CMD_ENABLE_TRIG:
            if (2 == unit)
            {
                p_regs2->ADCSR.BIT.TRGE = 1;           // enable sync/async triggers
            }
            else
            {
                p_regs->ADCSR.BIT.TRGE = 1;            // enable sync/async triggers
            }
            break;

        case ADC_CMD_DISABLE_TRIG:
            if (2 == unit)
            {
                p_regs2->ADCSR.BIT.TRGE = 0;           // disable sync/async triggers
            }
            else
            {
                p_regs->ADCSR.BIT.TRGE = 0;            // disable sync/async triggers
            }
            break;

        case ADC_CMD_SCAN_NOW:
            if (2 == unit)
            {
                if (0 == p_regs2->ADCSR.BIT.ADST)
                {
                    p_regs2->ADCSR.BIT.ADST = 1;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            else
            {
                if (0 == p_regs->ADCSR.BIT.ADST)
                {
                    p_regs->ADCSR.BIT.ADST = 1;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            break;

        case ADC_CMD_CHECK_SCAN_DONE:           // default/Group A or Group B
            if (2 == unit)
            {
                if (1 == p_regs2->ADCSR.BIT.ADST)
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            else
            {
                if (1 == p_regs->ADCSR.BIT.ADST)
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            break;

        case ADC_CMD_CHECK_SCAN_DONE_GROUPA:
            if (0 == unit)
            {
                if (1 == IR(S12AD,S12ADI))
                {
                    IR(S12AD,S12ADI) = 0;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            else if (1 == unit)
            {
                if (1 == IR(S12AD1,S12ADI1))
                {
                    IR(S12AD1,S12ADI1) = 0;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            else
            {
                if (1 == IR(S12AD2,S12ADI2))
                {
                    IR(S12AD2,S12ADI2) = 0;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            break;

        case ADC_CMD_CHECK_SCAN_DONE_GROUPB:
            if (0 == unit)
            {
                if (1 == IR(S12AD,GBADI))
                {
                    IR(S12AD,GBADI) = 0;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            else if (1 == unit)
            {
                if (1 == IR(S12AD1,GBADI1))
                {
                    IR(S12AD1,GBADI1) = 0;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            else
            {
                if (1 == IR(S12AD2,GBADI2))
                {
                    IR(S12AD2,GBADI2) = 0;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            break;

