renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx24t/r_s12ad_rx24t.c
    return ADC_SUCCESS;
} /* End of function adc_configure_scan() */


/******************************************************************************
* Function Name: adc_check_scan_config
* Description  : This function does extensive checking on channel mask
*                settings based upon operational mode.
*
* NOTE: A negative number is stored in two's complement form.
*       A quick way to change a binary number into two's complement is to
*       start at the right (LSB) and moving left, don't change any bits
*       until after the first "1" is reached.
*       Number          2's complement
*       0010 0110       1101 1010
*       Another way is to do a 1's complement on the number, then add 1 to that.
*       Number          1's complement  + 1
*       0010 0110       1101 1001       1101 1010
*
* Arguments    : p_config
*                    Pointer to channel config structure containing masks
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_INVALID_ARG-
*                    reg_id contains an invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon rest of configuration
*******************************************************************************/
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
static adc_err_t adc_check_scan_config(uint8_t const   unit,
                                        adc_ch_cfg_t   *p_config)
{
    uint8_t     i;
    uint32_t    tmp_mask=0;
    uint32_t    a_mask;
    uint32_t    b_mask;
    uint32_t    c_mask;

    aregs_t     *p_regs;

    /* A/D register address */
    if (0 == unit)
    {
        p_regs = (aregs_t *)&S12AD;
    }
    else if (1 == unit)
    {
        p_regs = (aregs_t *)&S12AD1;
    }
    else
    {
        p_regs = (aregs_t *)&S12AD2;
    }

    /* unit == 0 */
    INTERNAL_NOT_USED(unit);

    /* Verify at least one bonded channel is selected */
    if ((0 == p_config->chan_mask)
    || ((p_config->chan_mask & ADC_PRV_INVALID_CH_MASK(unit)) != 0))
    {
        return ADC_ERR_INVALID_ARG;
    }

    /* ADC_MASK_VOLT is groupA only. */
    if (ADC_MODE_SS_INT_REF_VOLT == g_dcb[unit].mode)
    {

        /* VOLT selection confirmation */
        if (0 == (p_config->chan_mask & ADC_MASK_VOLT))
        {
            return ADC_ERR_INVALID_ARG;
        }

        /* When A/D conversion of the internal reference voltage is to be performed, set all the bits in the ADANSA0
           and ADANSA1 and ADANSB0 and ADANSB1 and ADANSC0 and ADANSC1 registers and the ADCSR.DBLE bit should be set
            to all 0 in single scan mode. */
        if ((0 != (p_config->chan_mask & 0x00000FFF))          /* ADANSA0 != 0 and ADANSA1 != 0*/
        || (0 != (p_config->chan_mask_groupb & 0x00000FFF))    /* ADANSB0 != 0 and ADANSB1 != 0 */
        || (0 != (p_config->chan_mask_groupc & 0x00000FFF))    /* ADANSC0 != 0 and ADANSC1 != 0 */
        || (1 == p_regs->ADCSR.BIT.DBLE)        // double trigger mode
        || (2 != unit))                         // cannnot use unit0 and unit1
        {
            return ADC_ERR_INVALID_ARG;
        }

        /* Single scan mode only. */
        if (0 != p_regs->ADCSR.BIT.ADCS)
        {
            return ADC_ERR_ILLEGAL_ARG;

        }
    }

    /* Verify at least one unique bonded channel is selected for Group B
     * and GroupA priority setting is valid.
     */
    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        if ((0 == p_config->chan_mask_groupb)
        || ((p_config->chan_mask_groupb & ADC_PRV_INVALID_CH_MASK(unit)) != 0)
        || ((p_config->chan_mask_groupb & ADC_MASK_VOLT) != 0))
        {
            return ADC_ERR_INVALID_ARG;
        }
        else if ((p_config->chan_mask & p_config->chan_mask_groupb) != 0)
        {
            return ADC_ERR_ILLEGAL_ARG;         // same chan in both groups
        }
        else
        {
            tmp_mask = p_config->chan_mask_groupb;
        }

        if (1 == p_regs->ADGCTRGR.BIT.GRCE)     // for Group C
        {
            if ((0 == p_config->chan_mask_groupc)
            || ((p_config->chan_mask_groupc & ADC_PRV_INVALID_CH_MASK(unit)) != 0)
            || ((p_config->chan_mask_groupc & ADC_MASK_VOLT) != 0))
            {
                return ADC_ERR_INVALID_ARG;
            }
            else if (((p_config->chan_mask & p_config->chan_mask_groupb)
            || (p_config->chan_mask & p_config->chan_mask_groupc)
            || (p_config->chan_mask_groupb & p_config->chan_mask_groupc)) != 0)
            {
                return ADC_ERR_ILLEGAL_ARG;         // same chan in three groups
            }
            else
            {
                tmp_mask |= p_config->chan_mask_groupc;
            }
        }
    }
    else
    {

        /* for addition mask checking */
        if ((0 != p_config->chan_mask_groupb) || (0 != p_config->chan_mask_groupc))
        {
            return ADC_ERR_INVALID_ARG;
        }

        /* PGS bit must be set when group scan mode */
        if (ADC_GRPA_PRIORITY_OFF != p_config->priority_groupa)
        {
            return ADC_ERR_INVALID_ARG;
        }
    }

    /* Addition mask should not include bits from inactive channels */
    if (ADC_ADD_OFF != p_regs->ADADC.BIT.ADC)
    {
        tmp_mask |= p_config->chan_mask;        // tmp_mask is Group A and B and C combined

        /* Bit-AND with 1s-complement */
        if ((p_config->add_mask & (~tmp_mask)) != 0)
        {
            return ADC_ERR_INVALID_ARG;
        }
    }
    else
    {

        /* WARNING! Other features messed up if add_mask is non-zero when addition is turned off!*/

        p_config->add_mask = 0;
    }

    /* Verify only 1 bit is set in default/Group A mask */

    if ((ADC_MODE_SS_ONE_CH == g_dcb[unit].mode)
    || (ADC_MODE_CONT_ONE_CH == g_dcb[unit].mode)
    || (1 == p_regs->ADCSR.BIT.DBLE))           // double trigger mode
    {
        tmp_mask = p_config->chan_mask;         // tmp_mask is non-Group/Group A chans

        /* Bit-AND with 2s-complement (see note in function header) */
        if ((tmp_mask & ((~tmp_mask) + 1)) != tmp_mask)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }

