renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx24t/r_s12ad_rx24t.c
    if (0 != p_config->sample_hold_mask)
    {
        if ((0 == unit) || (2 == unit))         // S&H only on unit 1
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        /* S&H chans can only be 1 and must have at least minimum state count specified */
        if ((p_config->sample_hold_mask > 0x7)
        || (p_config->sample_hold_states < ADC_SST_SH_CNT_MIN))
        {
            return ADC_ERR_INVALID_ARG;
        }

        /* S&H channels cannot not be split across groups */
        a_mask = p_config->sample_hold_mask & p_config->chan_mask;
        b_mask = p_config->sample_hold_mask & p_config->chan_mask_groupb;
        c_mask = p_config->sample_hold_mask & p_config->chan_mask_groupc;

        /*  */
        if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
        {
            if ((a_mask != p_config->sample_hold_mask) && (b_mask != p_config->sample_hold_mask))
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
            if (1 == p_regs->ADGCTRGR.BIT.GRCE)
            {
                if ((a_mask != p_config->sample_hold_mask)
                && (b_mask != p_config->sample_hold_mask)
                && (c_mask != p_config->sample_hold_mask))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }
        }
        else if (a_mask != p_config->sample_hold_mask)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
        else
        {
            ;
        }

        /* S&H channels cannot be a double trigger channel (can be in group B) */
        if ((1 == p_regs->ADCSR.BIT.DBLE) && (0 != a_mask))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        /* S&H channels cannot be in GroupB if GroupA priority enabled */ 
        if (((0 != b_mask) || (0 != c_mask)) && (ADC_GRPA_PRIORITY_OFF != p_config->priority_groupa))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }

    /* If sensors specified, verify in legal configuration */
    if (p_config->chan_mask & ADC_MASK_SENSORS)
    {
        if ((1 == p_regs->ADCSR.BIT.DBLE)         // double trigger mode
        || (0 == unit) || (1 == unit))            // only unit2 has sensors
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }
    

    if ((ADC_DIAG_OFF != p_config->diag_method)
    &&   ((0 != p_regs->ADADC.BIT.ADC)            /* addition */
    || (1 == p_regs->ADCSR.BIT.DBLE)              /* double trigger mode */
    ))
    {
        return ADC_ERR_ILLEGAL_ARG;
    }

    if (0 != (p_regs->ADDISCR.BYTE & 0x0F))
    {
        if (0 != p_config->sample_hold_mask)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        for (i = 0 ; i < ADC_PGA_CHANNEL_MAX ; i++)
        {
            if (ADC_PGA_NOT_USE != p_config->pga_amp[i])
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
        }
    }

    return ADC_SUCCESS;
} /* End of function adc_check_scan_config() */
#endif /* ADC_CFG_PARAM_CHECKING_ENABLE == 1 */


/******************************************************************************
* Function Name: adc_configure_sensors
* Description  : This function set the sensor bits taking into account group
*                inclusion and addition/average mode.
* Arguments    : p_config -
*                   The configuration argument passed to ADC_CMD_ENABLE_CHANS.
* Return Value : none
*******************************************************************************/
static void adc_configure_sensors(adc_ch_cfg_t   *p_config)
{

    /* INTERNAL REFERENCE VOLTAGE SENSOR */
    if (ADC_MODE_SS_INT_REF_VOLT == g_dcb[2].mode)
    {

        /* A/D conversion of internal reference voltage is performed. */
        S12AD2.ADEXICR.BIT.OCSA = 1;
    }
    else
    {

        /* A/D conversion of internal reference voltage is not performed. */
        S12AD2.ADEXICR.BIT.OCSA = 0;
    }

    /* Internal Reference Voltage A/D-Converted Value Addition/Average Mode Select */
    S12AD2.ADEXICR.BIT.OCSAD = (p_config->add_mask & ADC_MASK_VOLT) ? 1 : 0;

    return;
} /* End of function adc_configure_sensors() */


/******************************************************************************
* Function Name: adc_enable_s12adi
* Description  : This function clears the S12ADI interrupt flag and enables
*                interrupts in the peripheral (for IR flag usage). If priority
*                is not 0, interrupts are enabled in the ICU.
*                NOTE: This has nothing to do with enabling triggers.
* Arguments    : unit -
*                   0
* Return Value : none
*******************************************************************************/
static void adc_enable_s12adi(uint8_t unit)
{

    if (0 == unit)
    {
        IR(S12AD,S12ADI) = 0;               // clear flag
        S12AD.ADCSR.BIT.ADIE = 1;           // enable in peripheral
        if (0 != IPR(S12AD,S12ADI))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD,S12ADI));        // enable in ICU
        }
    }
    else if (1 == unit) /* Unit1 */
    {
        IR(S12AD1,S12ADI1) = 0;             // clear flag
        S12AD1.ADCSR.BIT.ADIE = 1;          // enable in peripheral
        if (0 != IPR(S12AD1,S12ADI1))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD1,S12ADI1));      // enable in ICU
        }
    }
    else /* Unit2 */
    {
        IR(S12AD2,S12ADI2) = 0;             // clear flag
        S12AD2.ADCSR.BIT.ADIE = 1;          // enable in peripheral
        if (0 != IPR(S12AD2,S12ADI2))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD2,S12ADI2));      // enable in ICU
        }
    }

} /* End of function adc_enable_s12adi() */


/******************************************************************************
* Function Name: adc_enable_s12gbadi
* Description  : This function clears the S12GBADI interrupt flag and enables
*                interrupts in the peripheral (for IR flag usage). If priority
*                is not 0, interrupts are enabled in the ICU.
*                NOTE: This has nothing to do with enabling triggers.
* Arguments    : unit -
*                   0
* Return Value : none
*******************************************************************************/
static void adc_enable_s12gbadi(uint8_t unit)
{

    if (0 == unit)
    {
        IR(S12AD,GBADI) = 0;                // clear flag
        S12AD.ADCSR.BIT.GBADIE = 1;         // enable in peripheral
        if (0 != IPR(S12AD,GBADI))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD,GBADI));         // enable in ICU
        }
    }
    else if (1 == unit) /* Unit1 */
    {
        IR(S12AD1,GBADI1) = 0;              // clear flag
        S12AD1.ADCSR.BIT.GBADIE = 1;        // enable in peripheral
        if (0 != IPR(S12AD1,GBADI1))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD1,GBADI1));       // enable in ICU
        }
    }
    else /* Unit2 */
    {
        IR(S12AD2,GBADI2) = 0;              // clear flag
        S12AD2.ADCSR.BIT.GBADIE = 1;        // enable in peripheral
        if (0 != IPR(S12AD2,GBADI2))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD2,GBADI2));       // enable in ICU
        }
    }

} /* End of function adc_enable_s12gbadi() */


