renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx24t/r_s12ad_rx24t.c
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

    /* Show driver as closed */
    g_dcb[unit].opened = false;

    return ADC_SUCCESS;
} /* End of function adc_close() */

/******************************************************************************
* Function Name: adc_read_all
* Description  : This is implementation of R_ADC_ReadAll().
*                It reads conversion results from all potential sources,
*                enabled or not.
* Arguments    : p_data-
*                    Pointer to structure to load register values into.
* Return Value : ADC_SUCCESS-
*                    Successful
*******************************************************************************/
adc_err_t adc_read_all(adc_data_t * const  p_all_data)
{

    /* Read A/D conversion result of unit 0 */
    p_all_data->unit0.chan[ADC_REG_CH0]  = S12AD.ADDR0;
    p_all_data->unit0.chan[ADC_REG_CH1]  = S12AD.ADDR1;
    p_all_data->unit0.chan[ADC_REG_CH2]  = S12AD.ADDR2;
    p_all_data->unit0.chan[ADC_REG_CH3]  = S12AD.ADDR3;
    p_all_data->unit0.chan[ADC_REG_CH4_CH16] = S12AD.ADDR16;
    p_all_data->unit0.dbltrig            = S12AD.ADDBLDR;
    p_all_data->unit0.dbltrigA           = S12AD.ADDBLDRA;
    p_all_data->unit0.dbltrigB           = S12AD.ADDBLDRB;
    p_all_data->unit0.self_diag          = S12AD.ADRD;

    /* Read A/D conversion result of unit 1 */
    p_all_data->unit1.chan[ADC_REG_CH0]  = S12AD1.ADDR0;
    p_all_data->unit1.chan[ADC_REG_CH1]  = S12AD1.ADDR1;
    p_all_data->unit1.chan[ADC_REG_CH2]  = S12AD1.ADDR2;
    p_all_data->unit1.chan[ADC_REG_CH3]  = S12AD1.ADDR3;
    p_all_data->unit1.chan[ADC_REG_CH4_CH16] = S12AD1.ADDR16;
    p_all_data->unit1.dbltrig            = S12AD1.ADDBLDR;
    p_all_data->unit1.dbltrigA           = S12AD1.ADDBLDRA;
    p_all_data->unit1.dbltrigB           = S12AD1.ADDBLDRB;
    p_all_data->unit1.self_diag          = S12AD1.ADRD;

    /* Read A/D conversion result of unit 2 */
    p_all_data->unit2.chan[ADC_REG_CH0]  = S12AD2.ADDR0;
    p_all_data->unit2.chan[ADC_REG_CH1]  = S12AD2.ADDR1;
    p_all_data->unit2.chan[ADC_REG_CH2]  = S12AD2.ADDR2;
    p_all_data->unit2.chan[ADC_REG_CH3]  = S12AD2.ADDR3;
    p_all_data->unit2.chan[ADC_REG_CH4_CH16]  = S12AD2.ADDR4;
    p_all_data->unit2.chan[ADC_REG_CH5]  = S12AD2.ADDR5;
    p_all_data->unit2.chan[ADC_REG_CH6]  = S12AD2.ADDR6;
    p_all_data->unit2.chan[ADC_REG_CH7]  = S12AD2.ADDR7;
    p_all_data->unit2.chan[ADC_REG_CH8]  = S12AD2.ADDR8;
    p_all_data->unit2.chan[ADC_REG_CH9]  = S12AD2.ADDR9;
    p_all_data->unit2.chan[ADC_REG_CH10] = S12AD2.ADDR10;
    p_all_data->unit2.chan[ADC_REG_CH11] = S12AD2.ADDR11;
    p_all_data->unit2.volt               = S12AD2.ADOCDR;
    p_all_data->unit2.dbltrig            = S12AD2.ADDBLDR;
    p_all_data->unit2.dbltrigA           = S12AD2.ADDBLDRA;
    p_all_data->unit2.dbltrigB           = S12AD2.ADDBLDRB;
    p_all_data->unit2.self_diag          = S12AD2.ADRD;

    return ADC_SUCCESS;
} /* End of function adc_read_all() */

/*****************************************************************************
* Function Name: adc_s12adi0_isr
* Description  : Unit0 interrupt handler for normal/Group A/double trigger
*                scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void adc_s12adi0_isr(void)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb[0].p_callback) && (FIT_NO_FUNC != g_dcb[0].p_callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE;
        args.unit = 0;
        g_dcb[0].p_callback(&args);
    }
} /* End of function adc_s12adi0_isr() */


/*****************************************************************************
* Function Name: adc_s12adi1_isr
* Description  : Unit1 interrupt handler for normal/Group A/double trigger
*                scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void adc_s12adi1_isr(void)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb[1].p_callback) && (FIT_NO_FUNC != g_dcb[1].p_callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE;
        args.unit = 1;
        g_dcb[1].p_callback(&args);
    }
} /* End of function adc_s12adi1_isr() */


/*****************************************************************************
* Function Name: adc_s12adi2_isr
* Description  : Unit2 interrupt handler for normal/Group A/double trigger
*                scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void adc_s12adi2_isr(void)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb[2].p_callback) && (FIT_NO_FUNC != g_dcb[2].p_callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE;
        args.unit = 2;
        g_dcb[2].p_callback(&args);
    }
} /* End of function adc_s12adi2_isr() */


/*****************************************************************************
* Function Name: adc_s12gbadi0_isr
* Description  : Unit0 interrupt handler for Group B scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void adc_s12gbadi0_isr(void)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb[0].p_callback) && (FIT_NO_FUNC != g_dcb[0].p_callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE_GROUPB;
        args.unit = 0;
        g_dcb[0].p_callback(&args);
    }
} /* End of function adc_s12gbadi0_isr() */


/*****************************************************************************
* Function Name: adc_s12gbadi1_isr
* Description  : Unit1 interrupt handler for Group B scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void adc_s12gbadi1_isr(void)
{
    adc_cb_args_t   args;

